app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "test"], ["room_number", 1]]
---
    def create
        # byebug
        @school_class = SchoolClass.create(school_class_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @school_class = SchoolClass.find_by_id(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
    def edit
        @school_class = SchoolClass.find_by_id(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ? WHERE "school_classes"."id" = ?  [["room_number", 10], ["id", 9]]
---
    def update
        @school_class = SchoolClass.find_by_id(params[:id])
        @school_class.update(school_class_params)

SELECT "school_classes".* FROM "school_classes"
---
    def index
        # byebug
        @schools = SchoolClass.all