app/controllers/students_controller.rb

    def create
        # byebug
        @student = Student.create(student_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Larry"], ["last_name", "Bird"], ["created_at", "2020-02-26 18:00:00.813144"], ["updated_at", "2020-02-26 18:00:00.813144"]]

    def index
        # byebug
        @students = Student.all
---
SELECT "students".* FROM "students"